#include "robotstate.h"

ROBOPENGUIN robopenguin = {0.0f, //timestamp
                                                    SWIM_INIT, //游动状态
                                                    {0.0f,0.0f,0.0f,0.0f,0.0f,0.0f,0.0f,0.0f,
                                                        0.0f,0.0f,0.0f,0.0f,0.0f,0.0f,0.0f,0.0f,
                                                        0.0f,0.0f,0.0f,0.0f,0.0f,0.0f,0.0f,0.0f,
                                                        0.0f,0.0f,0.0f,0.0f,0.0f}, //游动参数
                                                    {0.0f, 0.0f, 0.0f, 0.0f, 0.0f, 0.0f, 0.0f, 0.0f, 0.0f}, //IMU数据
                                                    0.0f,//深度数据
                                                    {0.0f,0.0f,0.0f,0.0f,0.0f,0.0f,0.0f,0.0f,0.0f}, //功率数据
                                                    {0,0}, //限位开关状态
                                                    0,
                                                    0,
                                                    0
};
